{"id": 17939283, "status": "Acknowledged", "summary": "Municipal Development Department Director - Jennifer Turner, JD", "description": "On 11/21/24 PEO 8333 - D. Barnes issued citation 0076104584, 8-5-2-3 ABANDONED/INOPERABLE VEHICLES to this car? Issuing this citation is illegal as there is no \"citation\" or penalty for said ordinance.\n\nParking Enforcement Officers are only authorized to issue citations for 8-5-1-1 sequential not 8-5-2.\n8-1-2-46 ENFORCEMENT BY PARKING ENFORCEMENT OFFICERS AND SECURITY OFFICERS.\nParking Enforcement Officers and Security Officers authorized by the Chief of Police to issue citations shall only have the authority to issue citations for violations of §§ 8-5-1-1 et seq.\n\nThe ordinance outlining the penalties for chapter 8 is 8-1-3-99 and as you can see clearly does not have a penalty for 8-5-2-3.\n8-1-3-99 PENALTY.\n(A) General penalty. Unless another penalty is expressly provided in this Traffic Code or as otherwise provided by law, every person convicted of, or pleading guilty or no contest to, a violation of any section and/or this section of this Traffic Code shall be guilty of a petty misdemeanor and shall be punished by a fine of not more than $500 or by imprisonment for not more than 90 days or by both such fine and imprisonment.\n(B) Parking violations. The schedule of fines for parking violations shall be as follows:\n(1) The fines for violations of the following sections of this Traffic Code shall be:\nSection Amount\n8-5-1-1 $ 30\n8-5-1-2 30\n8-5-1-3 20\n8-5-1-4 30\n8-5-1-5 20\n8-5-1-6 20\n8-5-1-7 100\n8-5-1-8 30\n8-5-1-9 20\n8-5-1-10 - 8-5-1-29 30\n8-5-1-30 350\n8-5-1-31 - 8-5-1-41 30\n(2) Airport parking violation. Any person who violates the provisions of § 7-1- 1-4(G) shall pay a fine of$30.\n(3) Display and sale of motor vehicles. Any person who violates the provisions of § 7-5-3 shall pay a fine of $50. If the owner of the vehicle has violated the prohibition against concealment or removal of the license plate and/or concealment of the vehicle identification number, or, within a three month period, a vehicle has been cited two or more times for this offense, the vehicle may be towed, taken into custody and stored. The department conducting the tow shall initiate notification and hearing procedures as set forth in § 8-5-2-1 et seq. except that the decision of the hearing officer as set forth therein shall be limited to whether the vehicle was lawfully impounded for violation of this article. If it is determined at the hearing that the location and status of the vehicle was not in violation of this article, the owner of such vehicle shall not be liable for any expenses incurred as a result of the taking and storage of such vehicle, and the department which authorized the taking and storage of such vehicle shall be liable for such expenses, the department which authorized the taking and storage of such vehicle shall be liable to the owner for the amount paid by the owner.\n(4) Fines for any parking violation, including § 7-5-3 Display and Sale of Motor Vehicles, if not paid within ten days of the occurrence of the violation, shall be two times the amount of the fine, and if not paid within 20 days of the occurrence of the violation, shall be three times the amount of the fine, unless the person cited has initiated court proceedings to answer the charges within ten days of the issuance of the citation.\n(C) Construction and Curtilage Zone Penalty. Any person who violates any provision of any Traffic Code within this Code of Ordinances in an appropriately marked construction zone or curtilage zone, shall receive double any statutory fine or Court imposed fine. The total doubled fines combined may not exceed $500.00 or imprisonment for more than 90 days or both.\n(D) Driving in excess of speed limits. The schedule of fines for violations of §§ 8-2-4-1 through 8-2-4-3 ROA 1994 shall be as follows:\n(1) Up to and including ten miles an hour over the speed limit: $100;\n(2) From 11 up to and including 15 miles an hour over the speed limit: $150;\n(3) From 16 up to and including 20 miles an hour over the speed limit: $200;\n(4) From 21 up to and including 25 miles an hour over the speed limit: $250;\n(5) From 26 up to and including 30 miles an hour over the speed limit: $300;\n(6) From 31 up to and including 35 miles an hour over the speed limit: $350;\n(7) Over 35 miles an hour over the speed limit: $400.\n\nThere is no frequency of \"citations\" listed in ordinance 8-5-3-1 for 8-5-2-3 either.\n8-5-3-1 FREQUENCY OF PARKING CITATIONS.\n(A) Parking Citations No More Frequently Than One For Every Legal Time Period. A parking citation shall be issued whenever a vehicle is first found to be in violation of §§ 8-5-1-3, 8-5-1-5, 8-5-1-6, 8-5-1-8 and 8-5-1-9. Additional citations shall be issued at the expiration of each period of time equal to the legal period of time in which a vehicle may be parked at or within that particular stall or place. For example, if the \"VIOLATION\" flag is up at a 15-minute meter, the vehicle parked in violation at the metered stall shall be issued a parking citation immediately and shall then be issued additional parking citations no more frequently than every 15 minutes thereafter.\n(B) Parking Citations No More Frequently Than One For Every 55 Minutes. Whenever a vehicle is parked in violation of §§ 8-5-1-1, 8-5-1-2, 8-5-1-4, 8-5-1-10, 8-5-1-11, 8-5-1-13, 8-5-1-14, 8-5-1-15, 8-5-1-16, 8-5-1-17, 8-5-1-18, 8-5-1-20, 8-5-1-21, 8-5-1-26, 8-5-1-32, 8-5-1-34, 8-5-1-35, 8-5-1-36 or 8-5-1-38, parking citations shall not be issued more frequently than one for every 55 minutes. However, each such citation shall have, as an assessed standard fine of no less than five times the amount of the standard fine assessed for violations of the sections listed in division (A) above.\n(C) Parking Citation No More Frequently Than One For Every 24-Hour Period. Whenever a vehicle is parked in violation of §§ 8-5-1-12, 8-5-1-19, 8-5-1-25 and 8-5-1-43, parking citations shall not be issued more frequently than one for every 24-hour period.\n(D) Nothing in this section shall be deemed to limit the authority of the Police Department, Parking Enforcement Officer, or Security Officer to remove a vehicle as authorized in §§ 8-5-2-1 et seq.\n\nCitation Number:0076104584\nCreated:11/21/2024\nCitation Type:ABANDONED/INOPERABLE VEHICLES\nStatute Code:8-5-2-3\nOfficer:D. Barnes\nAgency:MDP\nStreet #:7000\nStreet:Saltbrush Road SW 87121\nVehicle Exp:1/2024", "rating": 2, "lat": 35.087620005129146, "lng": -106.65169600707091, "address": "1 Civic Plz Nw Albuquerque, New Mexico, 87102", "created_at": "2024-11-23T21:44:57-05:00", "acknowledged_at": "2024-11-23T21:45:10-05:00", "closed_at": null, "reopened_at": null, "updated_at": "2024-11-23T21:45:10-05:00", "shortened_url": null, "url": "https://seeclickfix.com/api/v2/issues/17939283", "point": {"type": "Point", "coordinates": [-106.65169600707091, 35.087620005129146]}, "private_visibility": false, "html_url": "https://seeclickfix.com/issues/17939283", "request_type": {"id": 17885, "title": "Other", "organization": "City of Albuquerque", "url": "https://seeclickfix.com/api/v2/request_types/17885", "related_issues_url": "https://seeclickfix.com/api/v2/issues?lat=35.087620005129146&lng=-106.65169600707091&request_types=17885&sort=distance"}, "comment_url": "https://seeclickfix.com/api/v2/issues/17939283/comments", "flag_url": "https://seeclickfix.com/api/v2/issues/17939283/flag", "transitions": {}, "reporter": {"id": 1288100, "name": "City of Albuquerque (ABQ311) Neighbor", "role": "Guest", "avatar": {"full": "https://seeclickfix.com/assets/no-avatar-100-4c3cf895b7ee80b7e97c54d1c7ee80ef9e8d176702efb9a7dcf02abb38ffa5b8.png", "square_100x100": "https://seeclickfix.com/assets/no-avatar-100-4c3cf895b7ee80b7e97c54d1c7ee80ef9e8d176702efb9a7dcf02abb38ffa5b8.png"}, "html_url": "https://seeclickfix.com/users/1288100", "witty_title": "", "civic_points": 0}, "media": {"video_url": null, "image_full": "https://seeclickfix.com/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBCSW5Jb0FFPSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--998060157602c8642a651e8670052d4a25237085/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9MWm05eWJXRjBTU0lJYW5CbkJqb0dSVlE2RUdGMWRHOWZiM0pwWlc1MFZEb0tjM1J5YVhCVU9ndHlaWE5wZW1WSklndzRNREI0TmpBd0Jqc0dWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--ee2a5b821fe0552ba6053903421e37a595d06845/0076104584.jpg", "image_square_100x100": "https://seeclickfix.com/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBCSW5Jb0FFPSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--998060157602c8642a651e8670052d4a25237085/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDem9MWm05eWJXRjBTU0lJYW5CbkJqb0dSVlE2RUdGMWRHOWZiM0pwWlc1MFZEb0tjM1J5YVhCVU9ndHlaWE5wZW1WSklnMHhNREI0TVRBd1hnWTdCbFE2REdkeVlYWnBkSGxKSWd0alpXNTBaWElHT3daVU9ndGxlSFJsYm5SSklnd3hNREI0TVRBd0Jqc0dWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--c6de1b85bcf6bb709fd9765dc81479dcfbbcac37/0076104584.jpg", "representative_image_url": "https://seeclickfix.com/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBCSW5Jb0FFPSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--998060157602c8642a651e8670052d4a25237085/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDem9MWm05eWJXRjBTU0lJYW5CbkJqb0dSVlE2RUdGMWRHOWZiM0pwWlc1MFZEb0tjM1J5YVhCVU9ndHlaWE5wZW1WSklnMHhNREI0TVRBd1hnWTdCbFE2REdkeVlYWnBkSGxKSWd0alpXNTBaWElHT3daVU9ndGxlSFJsYm5SSklnd3hNREI0TVRBd0Jqc0dWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--c6de1b85bcf6bb709fd9765dc81479dcfbbcac37/0076104584.jpg"}}